[
    {
        "id": 62156,
        "name": "Finite Mathematics",
        "year": 1,
        "prereq": [],
        "slotsByTerm": {},
        "description":  "This course includes the study of permutations and combinations, the binomal theorem, elementary set theory and logic, functions, relations, partial orders, mathematical induction and simple algorithms."
    },

    {
        "id": 62160,
        "name": "Comp Sci 1",
        "year": 1,
        "prereq": [],
        "slotsByTerm": {
            "1": [5]
        },
        "description":  "An introduction to digital systems, flowcharting, pseudocoding, and programming using the Java programming language."
    },

    {
        "id": 62161,
        "name": "Comp Sci 2",
        "year": 1,
        "prereq": [62160],
        "slotsByTerm": {
            "2": [5]
        },
        "description":  "A continuation of 62:160 COMP for those students wishing a more in-depth understanding of programming concepts."
    },

    {
        "id": 62171,
        "name": "Intro to Statistics",
        "year": 1,
        "prereq": [],
        "slotsByTerm": {
            "1": [3, 4, 11],
            "2": [1, 3]
        },
        "description":  "Descriptive statistics, frequency distributions, mean, variance, the normal distribution, probability theory, populations and samples, sampling distributions. Introduction to estimation and tests of hypotheses and simple linear regression."
    },

    {
        "id": 62172,
        "name": "Intro to Stat Inference",
        "year": 1,
        "prereq": [],
        "slotsByTerm": {
            "2": [3]
        },
        "description":  "A continuation of 62:171 STAT. Estimation, hypothesis testing, two-sample tests, tests for goodness-of-fit, contingency tables, regression and correlation, analysis of variance and non-parametric tests."
    },

    {
        "id": 62181,
        "name": "Calculus 1",
        "year": 1,
        "prereq": [],
        "slotsByTerm": {
            "1": [2],
            "2": [11]
        },
        "description":  "This course is intended for students who desire an introduction to calculus for use in applications and will stress intuitive methods of presentation."
    },

    {
        "id": 62182,
        "name": "Linear Algebra 1",
        "year": 1,
        "prereq": [],
        "slotsByTerm": {
            "1": [1],
            "2": [4]
        },
        "description":  "This course is an elementary introduction to the techniques of linear algebra. "
    },

    {
        "id": 62191,
        "name": "Calculus 2",
        "year": 1,
        "prereq": [62181],
        "slotsByTerm": {
            "2": [2]
        },
        "description":  "A continuation of 62:181 MATH with more advanced techniques of problem solving."
    },

    {
        "id": 62256,
        "name": "Discrete Struct/Prog 1",
        "year": 2,
        "prereq": [62161],
        "slotsByTerm": {
            "1": [3]
        },
        "description":  "Topics covered include: Java reviews (generics, inheritance, polymorphism, references, constructor chaining, exceptions, abstract classes, interfaces), recursions, big-Oh, big-Omega, and big-Theta notations, Pseudocode details, basic mathematical functions, algorithm analysis and design, stack, queue, deque, linked-list, vector, position, position-List, sequence, comparator, iterator, favorite-List, favorite-ListMTF, general tress, Java implementations of all data structures mentioned above, as well as applications in searching, deleting and sorting."
    },

    {
        "id": 62257,
        "name": "Discrete Struct/Prog 2",
        "year": 2,
        "prereq": [62256],
        "slotsByTerm": {
            "2": [3]
        },
        "description":  "Topics covered include: The tree ADT, traversals, binary trees, proper binary trees, Java implementations, array-based representation of binary tress, priority queue and sorting, heap and its operations, heap sorting, button-up heap construction, analysis, adaptable priority queue with heap implementation, maps, hash tables, double hashing and rehash, average-case analysis of performance, dictionaries, ordered dictionaries, binary search trees, BST-sorting, quick sort, merge-sort, skip lists, case-analysis by probability, AVL trees, (2, 4) trees, analysis, red black trees."
    },

    {
        "id": 62261,
        "name": "Intro Set Theory & Logic",
        "year": 2,
        "prereq": [62181],
        "slotsByTerm": {
            "1": [2]
        },
        "description":  "Introduction to set theory and mathematical logic and their applications to various operational and relational structures in mathematics, including fractions, relations, modular arithmetic, ordered sets, and cardinal numbers."
    },

    {
        "id": 62264,
        "name": "Digital Comp Fundamentals",
        "year": 2,
        "prereq": [],
        "slotsByTerm": {
            "1": [4]
        },
        "description":  "A course covering the elementary theory and components of logic circuits leading to an understanding of how components are assembled and controlled in a working computer."
    },

    {
        "id": 62290,
        "name": "Calculus 3",
        "year": 2,
        "prereq": [62191],
        "slotsByTerm": {
            "1": [1]
        },
        "description":  "An introduction to the calculus, analysis and geometry of functions of more than one variable, infinite series, partial differentiation, polar coordinates, parametric equations, and selected applications."
    },

    {
        "id": 62291,
        "name": "Calculus 4",
        "year": 2,
        "prereq": [62290],
        "slotsByTerm": {
            "2": [5]
        },
        "description":  "Multiple integration, vector-valued functions and an introduction to differential equations. This course also gives more mathematical depth to concepts introduced in 62:290 as well as further applications of a more complex nature."
    },

    {
        "id": 62351,
        "name": "Real Analysis 1",
        "year": 3,
        "prereq": [62261],
        "slotsByTerm": {
            "1": [2]
        },
        "description":  "Topics covered include: Sets and operations, functions, strong induction, supremum and infimum with applications, binary and ternary expansions, countable and uncountable sets, convergent sequences, limit theorems, monotone sequences, subsequences, Bolzano-Weierstrass theorem, Cauchy sequences, convergent series, open and closed sets, relatively open and closed sets, compact sets with several important properties, Heine-Borel theorem, the Cantor set with properties, limit of a function using the epsilon-delta definition, and continuous functions."
    },

    {
        "id": 62352,
        "name": "Real Analysis 2",
        "year": 3,
        "prereq": [62351],
        "slotsByTerm": {
            "2": [2]
        },
        "description":  "Topics covered include: Continuous functions by the epsilon-delta definition, topological characterization of continuity, continuity and compactness, fixed points, uniform continuity, Lipschitz functions, monotone functions and discontinuities, construction of monotone functions with prescribed discontinuities, inverse functions, derivatives, Rolle’s theorem, mean value theorem, Cauchy mean value theorem with their proofs and applications, inverse function theorem, proof of L’Hospital’s rule, upper and lower sums of the Riemann integral, integrability of continuous and monotone functions, Lebesgue theorem, properties of the Riemann integral and fundamental theorem of calculus, uniform convergence and continuity."
    },

    {
        "id": 62356,
        "name": "Modern Algebra 1",
        "year": 3,
        "prereq": [62261],
        "slotsByTerm": {
            "1": [4]
        },
        "description":  "An introduction to abstract algebra with a focus on group theory, including the following topics: Binary operations; semigroups and monoids; submonoids; inverses in monoids; groups; subgroups; various examples of groups, monoids, and semigroups; the integers modulo n; direct products; the order of an element; cyclic groups; isomorphisms and homomorphisms; Cayley's Theorem; cosets and Lagrange's Theorem; normal subgroups and congruence; quotient groups; kernels; the universal property of the quotient group; the First Isomorphism Theorem for groups; rings and ring homomorphisms (definitions and examples)."
    },

    {
        "id": 62357,
        "name": "Modern Algebra 2",
        "year": 3,
        "prereq": [62356],
        "slotsByTerm": {
            "2": [4]
        },
        "description":  "An introduction to the theory of rings and fields, including the following topics: Rings; subrings; units in rings; fields; integral domains; homomorphisms and isomorphisms of rings; the field of fractions of an integral domain; polynomial rings; the division algorithm for polynomials; ideals and congruence; quotient rings; prime and maximal ideals; kernels of ring homomorphisms; the characteristic of a ring; the universal property of the quotient ring; the First Isomorphism Theorem for rings; irreducible polynomials and roots of polynomials; unique factorization of polynomials; algebraically closed fields; vector spaces over a field; field extensions; algebraic and transcendental elements; finite extensions and algebraic extensions; the minimal polynomial of an algebraic element; simple extensions; algebraic closure. Additional topics may include: Straightedge and compass constructions; the constructible numbers; principal ideal domains, unique factorization domains, and Euclidean domains; splitting fields; separable extensions; Galois groups, Galois extensions, and the Fundamental Theorem of Galois Theory; modules over rings."
    },

    {
        "id": 62363,
        "name": "Complex Analysis",
        "year": 3,
        "prereq": [62290],
        "slotsByTerm": {
            "1": [3]
        },
        "description":  "Topics covered include: Complex numbers, limits, continuity, derivative, Cauchy-Riemann equations, analytic and harmonic functions, elementary functions, definite integrals, contour integrals, Cauchy theorem, Cauchy integral formula, Liouville’s theorem, fundamental theorem of algebra, maximum modulus principle, Taylor’s series, Laurent series, residue theorem with its application to computations of trigonometric and improper integrals."
    },

    {
        "id": 62353,
        "name": "Operating Systems 1",
        "year": 3,
        "prereq": [62257],
        "slotsByTerm": {
            "1": [6]
        },
        "description":  "Design and implementation of operating systems."
    },

    {
        "id": 62354,
        "name": "Operating Systems 2",
        "year": 3,
        "prereq": [62353],
        "slotsByTerm": {
            "2": [6]
        },
        "description":  "Operating Systems II will provide students with an intensive focus on conceptual and practical aspects of designing, implementing, and debugging concurrent and networked software systems using patterns and frameworks related to Java and Android middleware."
    },

    {
        "id": 62367,
        "name": "Computer Organization",
        "year": 3,
        "prereq": [62256],
        "slotsByTerm": {
            "1": [5]
        },
        "description":  "A survey of modern computer architectures."
    },

    {
        "id": 62373,
        "name": "Design/Analysis Algorithms",
        "year": 3,
        "prereq": [62257],
        "slotsByTerm": {
            "2": [4]
        },
        "description":  "The objective of this course is to introduce concepts and problem-solving techniques that are used in the design and analysis of efficient algorithms by studying sorting algorithms and a variety of data structures."
    },

    {
        "id": 62460,
        "name": "Programming Languages",
        "year": 4,
        "prereq": [62353],
        "slotsByTerm": {
            "2": [8]
        },
        "description":  "A survey of programming language concepts and design principles of programming paradigms (procedural, functional and logic)."
    },

    {
        "id": 62461,
        "name": "Theory of Computation",
        "year": 4,
        "prereq": [62261],
        "slotsByTerm": {
            "1": [4]
        },
        "description":  "An introduction to computability including Turing computable, abacus computable and recursive functions and the relation between them."
    },

    {
        "id": 62463,
        "name": "Software Engineering",
        "year": 4,
        "prereq": [62353],
        "slotsByTerm": {
            "1": [8]
        },
        "description":  "Software Engineering is a relatively new branch of computer science, which includes the development and building of computer systems software and applications software by engineering approaches."
    },


    {
        "id": 74161,
        "name": "Foundations of Physics I",
        "year": 1,
        "prereq": [],
        "slotsByTerm": {
            "1": [3]
        },
        "description":  "This course is a calculus based introduction to classical mechanics and thermodynamics."
    },

    {
        "id": 74162,
        "name": "Foundations of Physics II",
        "year": 1,
        "prereq": [74161],
        "slotsByTerm": {
            "2": [3]
        },
        "description":  "This course is a calculus-based introduction to waves, optics, electricity and magnetism, and quantum physics. "
    },

    {
        "id": 74272,
        "name": "Electricity and Magnetism",
        "year": 2,
        "prereq": [74162],
        "slotsByTerm": {
            "2": [1]
        },
        "description":  "This is an introductory course on the fundamentals of the electric charge and current, the electric and magnetic field, and electric potential."
    },

    {
        "id": 74273,
        "name": "Optics",
        "year": 2,
        "prereq": [74162],
        "slotsByTerm": {
            "1": [12]
        },
        "description":  "A study of reflection, refraction, lens systems, optical instruments, dispersion, achromatism, diffraction, interference, polarization."
    },

    {
        "id": 74275,
        "name": "Modern Physics",
        "year": 2,
        "prereq": [74162],
        "slotsByTerm": {
            "1": [5]
        },
        "description":  "Late in the 19th Century, many scientists believed there were few unsolved problems left in Science."
    },

    {
        "id": 74276,
        "name": "Mathematical Physics I",
        "year": 2,
        "prereq": [74162],
        "slotsByTerm": {
            "1": [4]
        },
        "description":  "opics to be discussed include vector algebra, differential and integral calculus of vectors, complex number theory and Fourier Series. "
    },

    {
        "id": 74281,
        "name": "Computational Physics",
        "year": 2,
        "prereq": [62191],
        "slotsByTerm": {
            "2": [11]
        },
        "description":  "This is an introductory course in modern tools and techniques in computational physics."
    },

    {
        "id": 74382,
        "name": "Intermediate Mechanics",
        "year": 3,
        "prereq": [74276],
        "slotsByTerm": {
            "1": [10]
        },
        "description":  "Topics to include kinematics, motion of a particle, a system of particles and rigid bodies, central force motion, and vibrations."
    },

    {
        "id": 74387,
        "name": "Statistical and Thermal Physics",
        "year": 3,
        "prereq": [74276],
        "slotsByTerm": {
            "1": [5]
        },
        "description":  "An account of thermal physics presented from a quantum viewpoint."
    },

    {
        "id": 74388,
        "name": "Quantum Mechanics I",
        "year": 3,
        "prereq": [74276],
        "slotsByTerm": {
            "1": [1]
        },
        "description":  "Basic quantum mechanical concepts are developed and solutions of the Schrodinger equation are obtained for a particle in a potential well, a harmonic oscillator and the hydrogen atom."
    }


]
